# Pandas

In [5]:
import pandas as pd

In [6]:
obj2 = pd.Series([4, 7, -5, 3], index = ['d', 'b', 'a', 'c'])
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [7]:
from pandas import Series, DataFrame   # pd. 도 안 써도 됨!

In [8]:
obj2['a']

-5

In [9]:
obj2[0]

4

In [10]:
obj2 > 0

d     True
b     True
a    False
c     True
dtype: bool

In [11]:
obj2[obj2 > 0]

d    4
b    7
c    3
dtype: int64

In [12]:
sdata = {'a':1}
type(sdata)

dict

In [13]:
obj3 = Series(sdata)
obj3                    # key 해당하는 데이터가 인덱스 label, 나머지 value

a    1
dtype: int64

In [14]:
obj3['a']

1

In [15]:
'Ohio' in obj3

False

In [16]:
'a' in obj3

True

In [17]:
1 in obj3

False

In [18]:
data = {
    'state':['Ohio', 'Ohio', 'Ohio', 'Nebada', 'Nebada'],
    'year':[2000, 2001, 2002, 2001, 2002],
    'pop':[1.5, 1.7, 3.6, 2.4, 2.9]
}

type(data)

dict

In [19]:
frame = DataFrame(data)
frame

# index 자동, key값이 컬럼
# 보기에 예쁘다

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nebada  2001  2.4
4  Nebada  2002  2.9

## 탐색 EDA

In [20]:
frame.year

0    2000
1    2001
2    2002
3    2001
4    2002
Name: year, dtype: int64

In [21]:
# row 단위로 작업 읽어오기

frame.describe()

             year       pop
count     5.00000  5.000000
mean   2001.20000  2.420000
std       0.83666  0.864292
min    2000.00000  1.500000
25%    2001.00000  1.700000
50%    2001.00000  2.400000
75%    2002.00000  2.900000
max    2002.00000  3.600000

In [22]:
# 데이터프레임 객체일 때, 판다스에 ix 속성이 생긴다! 
# 인덱스 [1] 1번인 것!    =>     0	Ohio	2000	1.5

frame.ix[1]

C:\Users\student\Anaconda3\lib\site-packages\ipykernel_launcher.py:4: FutureWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#ix-indexer-is-deprecated
  after removing the cwd from sys.path.

state    Ohio
year     2001
pop       1.7
Name: 1, dtype: object

In [23]:
# 데이터 프레임의 인덱스 속성을 임의의 문자열로 바꿈!!

frame.index = ['one', 'two', 'three', 'four', 'five']

In [24]:
frame.ix['one']   # 정확하게 키 값이 나온다.

C:\Users\student\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

state    Ohio
year     2000
pop       1.5
Name: one, dtype: object

## 인덱스 or 문자열 방법!
<br>
<br>
**label 방식**: 논리적(사람에 의해 조정이 가능)  => loc로 써라
<br>
**iloc** for positional indexing

In [25]:
frame.loc['two']

state    Ohio
year     2001
pop       1.7
Name: two, dtype: object

# 데이터 전처리 시  **R, Excel**이 필요하면 그걸 쓰기!

axis = 1 (행 기준)
<br>
axis = 0 (열 기준)

In [26]:
frame2 = frame.copy()  # 원본 보호 위해 복사본 만듦 (copy를 사용해야 실제 메모리도 카피가 된다.)
# 그냥 name만 복사하면 변수명만 다른 실제 메모리는 동일해지는 경우가 있으므로, 제대로 된 깊은 복사를 위해
# copy()   가 필수!

frame2.drop(['one'])

        state  year  pop
two      Ohio  2001  1.7
three    Ohio  2002  3.6
four   Nebada  2001  2.4
five   Nebada  2002  2.9

In [27]:
frame3 = frame
frame3 = frame3.drop(['three'])  # three 삭제   # 얘는 그래서 다시 대입을 해줘야 제대로 적용이 됨.
frame3

       state  year  pop
one     Ohio  2000  1.5
two     Ohio  2001  1.7
four  Nebada  2001  2.4
five  Nebada  2002  2.9

In [28]:
frame5 = frame.copy()
frame5.drop(['pop'], axis = 1)

        state  year
one      Ohio  2000
two      Ohio  2001
three    Ohio  2002
four   Nebada  2001
five   Nebada  2002

In [29]:
frame

        state  year  pop
one      Ohio  2000  1.5
two      Ohio  2001  1.7
three    Ohio  2002  3.6
four   Nebada  2001  2.4
five   Nebada  2002  2.9

In [30]:
frame['two':'four']

        state  year  pop
two      Ohio  2001  1.7
three    Ohio  2002  3.6
four   Nebada  2001  2.4

In [31]:
frame.loc['two']   # 행 읽기

state    Ohio
year     2001
pop       1.7
Name: two, dtype: object

In [32]:
# 비연속적! [[ ]]

frame.loc[['one', 'three', 'five']]

        state  year  pop
one      Ohio  2000  1.5
three    Ohio  2002  3.6
five   Nebada  2002  2.9

In [33]:
frame.loc['two':'four']

        state  year  pop
two      Ohio  2001  1.7
three    Ohio  2002  3.6
four   Nebada  2001  2.4

## 행 단위 loc
<br>**열 단위** 그냥 쓰면 됨!

In [36]:
import numpy as np

data = DataFrame(np.arange(16).reshape((4, 4)),
                index = ['Ohio', 'Colorado', 'Utah', 'New York'],
                columns = ['one', 'two', 'three', 'four'])

In [37]:
frame3 = DataFrame(np.random.rand(4, 3))  # 4행 3열   # 임의의 랜덤 값
frame3

          0         1         2
0  0.411605  0.913128  0.467848
1  0.582356  0.617544  0.494945
2  0.061075  0.013029  0.089082
3  0.204777  0.298866  0.782260

In [42]:
frame3.apply(f, axis = 1)  # 행 단위로 적용

NameError: name 'f' is not defined

In [40]:
import pandas as pd

df = pd.read_excel('./data/학생시험성적.xlsx')   # . : 현재 데이터셋  # sheet_name = 0
df

# 엑셀에 첫 번째 sheet 표를 불러온다.

  학생  국어  영어  수학         평균
0  A  80  90  85  85.000000
1  B  90  95  95  93.333333
2  C  95  70  75  80.000000
3  D  70  85  80  78.333333
4  E  75  90  85  83.333333

In [41]:
import pandas as pd

df = pd.read_excel('./data/학생시험성적.xlsx', sheet_name = 1)   # . : 현재 데이터셋  # sheet_name = 1
df

# 두 번째 sheet가 읽힌다.

  학생  과학  사회   역사         평균
0  A  90  95   85  90.000000
1  B  85  90   80  85.000000
2  C  70  80   75  75.000000
3  D  75  90  100  88.333333
4  E  90  80   90  86.666667

In [43]:
import pandas as pd

df = pd.read_excel('./data/학생시험성적.xlsx', sheet_name = '2차시험') 
df

  학생  과학  사회   역사         평균
0  A  90  95   85  90.000000
1  B  85  90   80  85.000000
2  C  70  80   75  75.000000
3  D  75  90  100  88.333333
4  E  90  80   90  86.666667

. : 현재 위치
<br>
.. : 상위